Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_115-The_Display_of_the_Pure_Land_of_Sukhavati-v1.tmx
Source language: bo
Languages: en

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་གནས་བརྟན་ཉན་ཐོས་ཆེན་པོ་དགྲ་བཅོམ་པ་ཤ་སྟག་ལ་
en: along with a large monastic saṅgha of 1,250 bhikṣus, all of them great elders, śrāvakas, and arhats,

source: མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་།
en: Mahā­maudgalyāyana,

source: འོད་སྲུང་ཆེན་པོ་དང་།
en: Mahākāśyapa,

source: འདི་ལྟ་སྟེ། གནས་བརྟན་ཤཱ་རིའི་བུ་དང་།
en: such as the Elder Śāriputra,

source: ཀ་པི་ན་ཆེན་པོ་དང་།
en: Mahākapphiṇa,

source: གསུས་པོ་ཆེ་དང་།
en: Mahākauṣṭhila,

source: ནམ་གྲུ་དང་།
en: Revata,

source: ལམ་ཕྲན་བསྟན་དང་།
en: Śuddhipaṃthaka,

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas and bodhisattvas.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན།
en: The Bhagavān was dwelling in Anāthapiṇḍada’s park in the Jeta Grove in Śrāvastī,

source: ཀཱ་ཏྱཱའི་བུ་ཆེན་པོ་དང་
en: Mahā­kātyāyana

source: དགའ་བོ་དང་། ཀུན་དགའ་བོ་དང་། སྒྲ་གཅན་ཟིན་དང་། བ་ལང་བདག་དང་། བྷ་ར་དྷྭ་ཛི་དང་། འཆར་བྱེད་ནག་པོ་དང་། བ་ཀུ་ལ་དང་། མ་འགགས་པ་དང་། དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་གཞན་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མང་པོ་ལ་འདི་ལྟ་སྟེ།
en: Nanda, Ānanda, Rāhula, Gavāṃpati, Bharadvāja, Kālodāyin, Vakula, and Aniruddha. He dwelt with these and other great śrāvakas and with many bodhisattva mahāsattvas,

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་ཕམ་པ་དང་།
en: the youthful Mañjuśrī, the Bodhisattva Mahāsattva Ajita,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོས་ཀྱི་གླང་པོ་དང་།
en: the Bodhisattva Mahāsattva Gandhahastin,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་ཏུ་བརྩོན་དང་།
en: the Bodhisattva Mahāsattva Nityodyukta,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་པ་མི་འདོར་བ་དང་།
en: and the Bodhisattva Mahāsattva Anikṣiptadhura,

source: དེ་དག་དང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཞན་མང་པོ་དག་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། དེ་དག་དང་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་མང་པོ་གཞན་དག་དང་ཡང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: along with many other bodhisattva mahāsattvas. He was also accompanied by Indra, the lord of gods, and Brahmā, the ruler of the Sahā world, along with many myriads of gods.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་པ།
en: On that occasion, the Bhagavān said to the venerable Śāriputra,

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ནུབ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Śāriputra, if you go from this buddha realm past 100,000 myriad buddha realms toward the western direction, there is a world known as Sukhāvatī (The Delightful).

source: དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚེ་དཔག་མེད་ཅེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: In that place the Tathāgata, the arhat, the perfectly and fully enlightened buddha known as Amitāyus (Immeasurable Life), dwells, lives, and abides, teaching the Dharma.

source: །ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། འཇིག་རྟེན་གྱི་ཁམས་དེ་ཅིའི་ཕྱིར་བདེ་བ་ཅན་ཞེས་བྱ་ཞེ་ན།
en: “Now what do you think, Śāriputra, why is that world called ‘Sukhāvatī’?

source: ཤཱ་རིའི་བུ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དེ་ན་སེམས་ཅན་རྣམས་ཀྱི་ལུས་ལ་སྡུག་བསྔལ་མེད། སེམས་ལ་སྡུག་བསྔལ་མེད་ཅིང་བདེ་བའི་རྒྱུ་ཚད་མེད་པར་ཡོད་དེ། དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ཞེས་བྱའོ
en: “Śāriputra, in the Sukhāvatī world, sentient beings experience neither physical pain nor mental suffering and the causes for their happiness are limitless. For this reason, this world is called Sukhāvatī. Furthermore,

source: ཤཱ་རིའི་བུ་གཞན་ཡང་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ནི་ཁ་ཁྱེར་རིམ་པ་བདུན་དང་། ཤིང་ཏ་ལའི་ཕྲེང་བ་རིམ་པ་བདུན་དང་། དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་རྣམས་ཀྱིས་ཀུན་ནས་ཡོངས་སུ་བསྐོར་བ། བཀྲ་བ་བལྟ་ན་སྡུག་པའོ།
en: Śāriputra, the Sukhāvatī world is surrounded on all sides by seven layers of terraces, seven rows of palm trees, and filigrees of chimes. It is radiantly beautiful.

source: རང་རང་གི་སྐད་དག་གིས་སྨྲའོ
en: each singing its own melody.

source: །དེ་དག་སྨྲ་བ་ན་དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་སྒྲ་དག་འབྱུང་ངོ་།
en: When they sing, the sounds of the powers, strengths, and branches of enlightenment emerge.

source: །སེམས་ཅན་གང་དག་དེར་སྐྱེས་པ་དེ་དག་གིས་སྒྲ་དེ་ཐོས་ནས་སངས་རྒྱས་ཡིད་ལ་བྱེད་པ་སྐྱེ།
en: Upon hearing those sounds, the sentient beings born there are moved to contemplate the Buddha

source: ཆོས་ཡིད་ལ་བྱེད་པ་སྐྱེ། དགེ་འདུན་ཡིད་ལ་བྱེད་པར་སྐྱེའོ།
en: to contemplate the Dharma, and to contemplate the Saṅgha.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་སྐྱེ་བའི་མིང་ཡང་མེད་དོ།
en: Śāriputra, in this buddha realm there are not even words for birth as a hell being, birth as an animal, or birth in the world of the Lord of Death.

source: །བྱའི་ཚོགས་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་དེ་ཉིད་ཀྱིས་ཆོས་ཀྱི་སྒྲ་དབྱུང་བའི་ཕྱིར་སྤྲུལ་པ་དག་གོ།
en: Those flocks of birds were manifested by the Tathāgata Amitāyus himself to voice the sound of Dharma.

source: འདི་ལྟ་སྟེ་དཔེར་ན། རོལ་མོ་མཁན་གྱིས་ཡན་ལག་བྱེ་བ་འབུམ་དང་ལྡན་པའི་ལྷའི་སིལ་སྙན་བླངས་པ་བཞིན་ནོ།
en: like the myriad subtleties of divine cymbals when played by a skilled musician.

source: །དེར་མི་དེ་དག་གིས་སྒྲ་དེ་ཐོས་ནས་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་ལུས་ལ་གནས་སོ།
en: The people there, upon hearing those sounds, settle into the recollection of the Buddha, the recollection of the Dharma, and the recollection of the Saṅgha.

source: །ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པའི་རྒྱན་རྣམ་པ་དེ་ལྟ་བུ་དག་གིས་ལེགས་པར་བརྒྱན་པའོ། །ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: Śāriputra, this buddha realm is beautifully adorned by such displays of the excellences of buddha realms. “Now what do you think, Śāriputra,

source: །ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་རྣམ་པ་དེ་ལྟ་བུ་དག་གིས་ལེགས་པར་བརྒྱན་པའོ། །ཤཱ་རིའི་བུ་གཞན་ཡང་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ན་ངང་པ་དང་། ཁྲུང་ཁྲུང་དང་། རྨ་བྱ་དག་ཡོད་པ་དེ་དག་ཀྱང་ཉིན་ལན་གསུམ། མཚན་ལན་གསུམ་འདུས་ནས་ཡང་དག་པར་བགྲོ་བར་བྱེད་དེ།
en: Śāriputra, this buddha realm is beautifully adorned by such displays of the excellences of buddha realms. “Furthermore, Śāriputra, in the Sukhāvatī world there are swans, cranes, and peacocks that assemble three times during the day and three times at night and perform a concert,

source: །ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། སེམས་ཅན་དེ་དག་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་ཡིན་སྙམ་དུ་སེམས་པ་ལྟ་ན་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Now what do you think about this, Śāriputra? Have those sentient beings taken birth as animals? You should not think so. Why is that so?

source: །ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་རྣམ་པ་དེ་ལྟ་བུ་དག་གིས་ལེགས་པར་བརྒྱན་པའོ། །ཤཱ་རིའི་བུ་གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་དེའི་ཏ་ལའི་ཕྲེང་བ་དེ་དག་དང་།
en: Śāriputra, this buddha realm is beautifully adorned by such displays of the excellences of buddha realms. “Furthermore, Śāriputra, when the wind blows in that buddha realm it sways the rows of palm trees

source: དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དེ་དག་ལ་རླུང་གིས་ཕོག་ཅིང་རླུང་གིས་བསྐྱོད་ན་སྒྲ་སྙན་པ་ཡིད་དུ་འོང་བ། ཉམས་དགའ་བ་འབྱུང་སྟེ།
en: and the filigree net of chimes, creating sweet, enchanting, and delightful sounds,

source: ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་ཏུ་མེད་ཅེས་བྱ་ཞེ་ན།
en: why is that tathāgata called ‘Amitāyus’ (Immeasurable Life)?

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་དེའི་ཚེའི་ཚད་དཔག་ཏུ་མེད་དེ།
en: Śāriputra, the lifespan of Tathāgata Amitāyus is immeasurable.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་ཅེས་བྱའོ།
en: For this reason, he is called ‘Tathāgata Amitāyus.’

source: ཤཱ་རིའི་བུ་གཞན་ཡང་ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་འོད་དཔག་མེད་ཅེས་བྱ་ཞེ་ན།
en: Furthermore, Śāriputra, why is that tathāgata called ‘Amitābha’ (Immeasurable Light)?

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེའི་འོད་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་དེ།
en: Śāriputra, the light of Tathāgata Amitābha shines unimpeded throughout all buddha realms.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཅེས་བྱའོ།
en: For this reason, he is called ‘Tathāgata Amitābha.’

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བསྐལ་པ་བཅུ་ལོན་ནོ།
en: The Bhagavān Tathāgata Amitābha fully awakened to unsurpassable, completely perfect enlightenment ten eons ago

source: །ཤཱ་རིའི་བུ་གཞན་ཡང་བཅོམ་ལྡན་འདས་དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དག་པ་དགྲ་བཅོམ་པ་ཤ་སྟག་ཚད་མེད་དེ།
en: “Furthermore, Śāriputra, this bhagavān has an immeasurable saṅgha of śrāvakas, who are all pure arhats;

source: དེ་དག་གི་ཚད་བརྗོད་པར་སླ་བ་མ་ཡིན་ནོ།
en: heir number cannot be easily expressed.

source: །ཤཱ་རིའི་བུ་གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེས་པའི་སེམས་ཅན་དག་ནི་ཕྱིར་མི་ལྡོག་པ། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དག་པ་ཤ་སྟག་གོ།
en: Furthermore, Śāriputra, the sentient beings born in this buddha realm are all pure bodhisattvas who will not regress and are bound by only one more birth.

source: །ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་ཚད་ནི་བརྗོད་པར་སླ་བ་མ་ཡིན་ཏེ།
en: Śāriputra, one cannot express the total number of bodhisattvas except to say that they are immeasurable or countless.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་རྣམ་པ་དེ་ལྟ་བུ་དག་གིས་ལེགས་པར་བརྒྱན་པའོ།
en: Śāriputra, this buddha realm is beautifully adorned by such displays of the excellences of buddha realms.

source: ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་བྱ་བའི་ཕྱིར་དགེ་བའི་རྩ་བ་རྣམས་གུས་པར་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: Therefore Śāriputra, sons and daughters of good family should completely dedicate all roots of virtue in a respectful manner to be born in that buddha realm.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་སྐྱེས་བུ་དམ་པ་དེ་ལྟ་བུ་དག་དང་ཕྲད་པར་འགྱུར་བའི་ཕྱིར་རོ།
en: Why? Because by doing so, they will be able to meet holy beings similar to themselves.

source: །ཤཱ་རིའི་བུ་དགེ་བའི་རྩ་བ་ངན་ངོན་ཙམ་གྱིས་ནི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་དེའི་ཞིང་དུ་སྐྱེ་བར་མི་འགྱུར་རོ།
en: Śāriputra, one cannot take birth in the realm of Bhagavān Tathāgata Amitāyus merely with minimal roots of virtue.

source: །ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་དེའི་མཚན་ཐོས་ལ་ཐོས་ནས་ཀྱང་ཡིད་ལ་བྱེད་ཅིང་ནུབ་གཅིག་གམ། ནུབ་གཉིས་སམ། ནུབ་གསུམ་མམ། ནུབ་བཞི་འམ། ནུབ་ལྔའམ། ནུབ་དྲུག་གམ། ནུབ་བདུན་དུ་གཡེང་བ་མེད་པའི་སེམས་ཀྱིས་ཡིད་ལ་བྱེད་ན།
en: “Śāriputra, if those sons and daughters of good family hear the name of the Bhagavān Tathāgata Amitāyus and keep it in mind unwaveringly for one, two, three, four, five, six, or seven nights,

source: །དེ་བཞིན་དུ་ལྷོ་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ཉི་ཟླའི་སྒྲོན་མ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་གྲགས་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་གྲགས་པའི་འོད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་འོད་འཕྲོ་ཕུང་པོ་ཞེས་བྱ་བ་དང་།
en: ’“Likewise, in the south, the bhagavān buddhas of the south, such as the Tathāgata Candra­sūrya­pradīpa, the Tathāgata Renown, the Tathāgata Yaśaḥprabha,

source: ཁྱེད་ཅག་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བརྗོད་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཡིད་ཆེས་པར་གྱིས་ཤིག་ཅེས་གསུང་བ་མཛད་དོ།
en: ‘You should place your trust in this Dharma discourse called “Complete Embrace by all Buddhas,” which praises inconceivable qualities.

source: །ཤཱ་རིའི་བུ་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་ངས་ད་ལྟར་ཡོངས་སུ་བརྗོད་པ་དེ་བཞིན་དུ་ཤཱ་རིའི་བུ་ཤར་ཕྱོགས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ལྷུན་པོའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་དང་།
en: “O Śāriputra, I, the Tathāgata, at present praise [this Sukhāvatī]. So, likewise, Śāriputra, in the east, the Tathāgata Akṣobhya, the Tathāgata Merudhvaja,

source: དེ་བཞིན་གཤེགས་པ་ལྷུན་པོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ལྷུན་པོ་ཆེན་པོ་ཞེས་བྱ་བ་དང་།
en: the Tathāgata Meru, the Tathāgata Mahāmeru,

source: དེ་བཞིན་གཤེགས་པ་ལྷུན་པོ་ཆེན་པོ་སྣང་བ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་འཇམ་སྒྲ་ཞེས་བྱ་བ་དང་།
en: the Tathāgata Mahā­meru­prabhāsa, the Tathāgata Harmonious Speech,

source: དེ་བཞིན་གཤེགས་པ་འཇམ་དབྱངས་ཞེས་བྱ་བ་དང་།
en: the Tathāgata Harmonious Voice,

source: དེ་དག་ལ་སོགས་པ་ཤར་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ལྗགས་ཀྱི་དབང་པོས་ཁེབས་པར་མཛད་དེ།
en: and the other bhagavān buddhas of the east, who are as numerous as the sands of the river Ganges, pervade their own buddha realms with the power of their speech and proclaim,

source: །ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་དོན་གྱི་དབང་དེ་མཐོང་ནས་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོས་སངས་རྒྱས་ཀྱི་ཞིང་དེར་གུས་པར་སྨོན་ལམ་གདབ་པར་བྱའོ་ཞེས་དེ་སྐད་བརྗོད་དོ
en: Therefore, Śāriputra, having seen its real point, sons and daughters of good family, I declare, ought to respectfully make prayers to reach that buddha realm.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་སྣང་བ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་ཏོག་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་དག་པ་ཞེས་བྱ་བ་དང་།
en: the Tathāgata Illuminating Light Rays, the Tathāgata Ratnaketu, the Tathāgata Śuddha­raśmi­prabha,

source: དེ་བཞིན་གཤེགས་པ་ལྷུན་པོའི་སྒྲོན་མ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་མཐའ་ཡས་ཞེས་བྱ་བ་དང་། དེ་དག་ལ་སོགས་པ་ལྷོ་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ལྗགས་ཀྱི་དབང་པོས་ཁེབས་པར་མཛད་དེ།
en: the Tathāgata Merupradīpa, the Tathāgata Anaṃtavīrya, and others, who are as numerous as the sands of the river Ganges, pervade their own buddha realms with the power of their speech and proclaim,

source: ཁྱེད་ཅག་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བརྗོད་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཡིད་ཆེས་པར་གྱིས་ཤིག་ཅེས་གསུང་བ་མཛད་དོ། །དེ་བཞིན་དུ་ནུབ་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་ཚེ་དཔག་མེད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཕུང་པོ་དཔག་མེད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རྒྱལ་མཚན་དཔག་མེད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་འོད་ཆེན་ཞེས་བྱ་བ་དང་།
en: ‘You should place your trust in this Dharma discourse called “Complete Embrace by all Buddhas,” which praises inconceivable qualities.’“Likewise, in the west, the bhagavān buddhas of the west, such as the Tathāgata Amitāyus, the Tathāgata Amitaskandha, the Tathāgata Amitadhvaja, the Tathāgata Mahāprabha,

source: དེ་དག་ལ་སོགས་པ་ནུབ་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ལྗགས་ཀྱི་དབང་པོས་ཁེབས་པར་མཛད་དེ། ཁྱེད་ཅག་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བརྗོད་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཡིད་ཆེས་པར་གྱིས་ཤིག་ཅེས་གསུང་བ་མཛད་དོ།
en: and others, who are as numerous as the sands of the river Ganges, pervade their own buddha realms with the power of their speech and proclaim, ‘You should place your trust in this Dharma discourse called “Complete Embrace by all Buddhas,” which praises inconceivable qualities.’

source: །དེ་བཞིན་དུ་བྱང་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་འོད་འཕྲོའི་ཕུང་པོ་ཆེན་པོ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྒྲོལ་བའི་དབྱངས་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་རབ་ཏུ་ཐུལ་དཀའ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཉི་མ་འབྱུང་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་དྲ་བ་ཅན་གྱི་འོད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་འོད་ཀྱི་འབྱུང་གནས་ཞེས་བྱ་བ་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ལྗགས་ཀྱི་དབང་པོས་ཁེབས་
en: Likewise, in the north, the bhagavān buddhas of the north, such as the Tathāgata Mahārciskandha, the Tathāgata Vaiśvānara­nirghoṣa, the Tathāgata Duṣpradharṣa, the Tathāgata Āditya­saṃbhava, the Tathāgata Jālinīprabha, the Tathāgata Prabhākara,

source: དེ་དག་ལ་སོགས་པ་སྟེང་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ལྗགས་ཀྱི་དབང་པོས་ཁེབས་པར་མཛད་དེ། ཁྱེད་ཅག་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བརྗོད་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་ཡིད་ཆེས་པར་གྱིས་ཤིག་ཅེས་གསུང་བ་མཛད་དོ།
en: and others who are as numerous as the sands of the river Ganges, pervade their own buddha realms with the power of their speech and proclaim, ‘You should place your trust in this Dharma discourse called “Complete Embrace by all Buddhas,”

source: །ཤཱ་རིའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཅིའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བཟུང་བ་ཞེས་བྱ་ཞེ་ན།
en: which praises Sukhāvatī’s inconceivable qualities.’“What do you think about this, Śāriputra, why is this Dharma discourse called ‘Complete Embrace by All Buddhas’?

source: ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་མཚན་ཐོས་པར་གྱུར་པ་དང་། ཐོས་པ་དང་ཐོས་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཡོངས་སུ་བཟུང་བར་འགྱུར་རོ།
en: Śāriputra, those sons and daughters of good family who have heard, now hear, or will hear this Dharma discourse and the names of those bhagavān buddhas will all be embraced completely by the bhagavān buddhas.

source: ཤཱ་རིའི་བུ་སེམས་ཅན་གང་དག་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སེམས་ཀྱིས་སྨོན་པར་བྱེད་པའམ། བྱས་པའམ། བྱེད་པའམ། བྱེད་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་གོ། ། ཕྱིར་མ་ལོག་གོ་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Śāriputra, of all those sentient beings who aspire, who have made, are making, or will make aspirations to the Sukhāvatī world, the buddha realm of the Bhagavān Tathāgata Amitābha, none has turned away, is turning away, nor will ever turn away from the pursuit of unsurpassable, completely perfect enlightenment.

source: ཤཱ་རིའི་བུ་ཇི་ལྟར་ད་ལྟ་རང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བརྗོད་པ་དེ་བཞིན་དུ།
en: Śāriputra, just as I now praise the inconceivable qualities of those bhagavān buddhas, likewise,

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ངའི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བརྗོད་དོ།
en: Śāriputra, those bhagavān buddhas also praise my inconceivable qualities.”

source: ཤཱ་རིའི་བུས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ཤཱཀྱའི་རྒྱལ་པོས་བསྐལ་པའི་སྙིགས་མ་དང་། ཉོན་མོངས་པའི་སྙིགས་མ་དང་། སེམས་ཅན་གྱི་སྙིགས་མ་དང་། ལྟ་བའི་སྙིགས་མ་དང་། ཚེའི་སྙིགས་མའི་ཚེ་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: Śāriputra declared, “Bhagavān Śākyamuni, king of the Śākyas, you have fully awakened to unsurpassable, completely perfect enlightenment in this Sahā world. You have taught the Dharma that the whole world was reluctant to accept at the time of the degeneration of the eon,

source: འཇིག་རྟེན་ཐམས་ཅད་དང་མི་འཐུན་པའི་ཆོས་བསྟན་པ་ནི་ངོ་མཚར་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་སྙིགས་མ་ལྔའི་ཚེ་འཇིག་རྟེན་དུ་ངས་གང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: the degeneration of afflictions, the degeneration of beings, the degeneration of views, and the degeneration of lifespan. How marvelous indeed!” The Bhagavān replied, “Śāriputra, having fully awakened to unsurpassable, completely perfect enlightenment in this world, the Sahā world, at the time of the five degenerations,

source: འཇིག་རྟེན་ཐམས་ཅད་དང་མི་འཐུན་པའི་ཆོས་བསྟན་པ་དེ་ནི་མཆོག་ཏུ་དཀའ་བ་བྱེད་པའོ།
en: I have taught the Dharma that the whole world was reluctant to accept.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་།
en: After the Bhagavān had thus spoken, the whole world, including the venerable Śāriputra,

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: the great śrāvakas, bodhisattvas, gods, humans, demigods, and gandharvas were delighted and praised highly the words spoken by the Bhagavān.

source: །རྒྱ་གར་གྱི་མཁན་པོ་དཱ་ན་ཤཱི་ལ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙཱ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་གཏན་ལ་ཕབ་པ།།
en: This sūtra was translated and finalized by the Indian abbot Dānaśīla and the principal revisor-translator, the monk Yeshé Dé, along with others.

source: འཕགས་པ་བདེ་བ་ཅན་གྱི་བཀོད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: This completes the Noble Mahāyāna Sūtra The Display of Sukhāvatī.

source: །ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་རིན་པོ་ཆེ་སྣ་བཞི་ལ་འདི་ལྟ་སྟེ། གསེར་དང་། དངུལ་དང་། བཻ་དཱུརྱ་དང་། ཤེལ་དང་། རྣམ་པ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་གིས་ལེགས་པར་བརྒྱན་པའོ།
en: Śāriputra, this buddha realm is beautifully adorned with displays of the excellences of buddha realms, such as the four kinds of jewels, namely, gold, silver, beryl, and crystal.

source: །ཤཱ་རིའི་བུ་གཞན་ཡང་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ན་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རྫིང་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་ཡོངས་སུ་གང་བ།
en: Furthermore, Śāriputra, the Sukhāvatī world has ponds adorned with seven kinds of jewels. The ponds are full of water possessing the eight qualities.

source: རིན་པོ་ཆེའི་པད་མས་ཁེབས་པ། བྱ་རོག་གིས་བཏུང་དུ་རུང་བར་ཁ་ད་ཆད་དུ་གྱུར་པ་གསེར་གྱི་བྱེ་མ་བདལ་བ་དག་ཡོད་དེ།
en: They are covered by jeweled lotuses, are filled to the top to enable crows to drink, and are lined with golden sand.

source: རྫིང་དེ་དག་གི་ཕྱོགས་བཞི་ཀུན་ན་ཐེམ་སྐས་བཀྲ་བ། བལྟ་ན་སྡུག་པ། གསེར་དང་། དངུལ་དང་། བཻ་དཱུརྱ་དང་། ཤེལ་དང་། རིན་པོ་ཆེ་སྣ་བཞི་ལས་བྱས་པ་བཞི་བཞི་ཡོད་དོ།
en: All around, on the four sides of the ponds are four radiantly elegant staircases, each made of one of the four precious substances: gold, silver, beryl, and crystal.

source: །རྫིང་དེ་དག་གི་འགྲམ་ན་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་རིན་པོ་ཆེ་སྣ་བདུན་ལ་འདི་ལྟ་སྟེ། གསེར་དང་། དངུལ་དང་། བཻ་དཱུརྱ་དང་། ཤེལ་དང་། མུ་ཏིག་དམར་པོ་དང་། རྡོའི་སྙིང་པོ་དང་། སྤུག་གི་ཤིང་བཀྲ་བ། བལྟ་ན་སྡུག་པ་དག་སྐྱེས་སོ།
en: By the banks of the ponds grow jeweled trees of the seven radiantly beautiful jewels: gold, silver, beryl, crystal, rosy pearls, emerald, and coral.

source: གསེར་དང་། གསེར་གྱི་ཁ་དོག །གསེར་གྱི་འོད་འབྱུང་བ། གསེར་ལྟ་བུར་སྟོན་པ།
en: The golden lotuses have a golden hue, a golden sheen, and manifest as gold.

source: སྔོན་པོ་ཁ་དོག་སྔོན་པོ། འོད་སྔོན་པོ་འབྱུང་བ། སྔོན་པོ་ལྟ་བུར་སྟོན་པ།
en: The blue ones have a blue hue, a blue sheen, and manifest as blue.

source: སེར་པོ་ཁ་དོག་སེར་པོ། འོད་སེར་པོ་འབྱུང་བ། སེར་པོ་ལྟ་བུར་སྟོན་པ།
en: The yellow ones have a yellow hue, a yellow sheen, and manifest as yellow.

source: དེ་བཞིན་གཤེགས་པ་རེ་རེ་ལ་ཡང་མེ་ཏོག་སྐོན་བུ་བྱེ་བ་ཕྲག་འབུམ་མངོན་པར་འཐོར་ཏེ།
en: They also toss hundreds of thousands of bouquets of flowers toward each tathāgata.

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་འཆི་བའི་དུས་ཀྱི་ཚེ་ཕྱིན་ཅི་ལོག་མེད་པའི་སེམས་ཀྱིས་འཆི་བའི་དུས་བྱས་ནས་འཆི་བའི་དུས་བྱས་པ་དེ་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་ཉན་ཐོས་ཀྱི་དགེ་འདུན་གྱིས་ཡོངས་སུ་བསྐོར་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་མདུན་གྱིས་བལྟས་པའི་མདུན་ན་བཞུགས་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་དཔག་མེད་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: when the hour of their death arrives, they will depart in an undeluded state. After they have passed away, the Tathāgata Amitābha will stand before them, entirely surrounded by a śrāvaka assembly and accompanied by a congregation of bodhisattvas. These sons and daughters of good family will be born in the Sukhāvatī world, the buddha realm of the Bhagavān Tathāgata Amitābha.

source: །དེ་བཞིན་དུ་འོག་གི་ཕྱོགས་ན་དེ་བཞིན་གཤེགས་པ་སེང་གེ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་གྲགས་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་གྲགས་འོད་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཆོས་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཆོས་འཛིན་ཅེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་དང་།
en: Likewise, in the nadir, the bhagavān buddhas of the nadir, such as the Tathāgata Siṃha, the Tathāgata Yaśas, the Tathāgata Yaśaḥprabhāsa, the Tathāgata Dharma, the Tathāgata Dharmadhara, the Tathāgata Dharmadhvaja,

source: དེ་དག་ལ་སོགས་པ་འོག་གི་ཕྱོགས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་ལྗགས་ཀྱི་དབང་པོས་ཁེབས་པར་མཛད་དེ།
en: and others, who are numerous as the sands of the river Ganges, pervade their own buddha realms with the power of their speech
